[
    {
        "id":"21","status":"1","category":"game","title":"Insight Development","vip":"0","slug":"snake",
        "docs":"","images":"[]","date": "1675526107817","abstract":"As a developer, you may believe that your job is solely to write code and solve problems. However, sharing your knowledge and experiences through blog posts can provide many benefits for your personal and professional growth. In this article, we will explore the advantages of writing blog posts and how it can establish you as an expert in your field, help you build a strong professional network, and improve your skills",
        "url": "http://duno.altervista.org/games/snake/"
    },
    {
        "id":"22","status":"1","category":"game","title":"CUB Methodology","vip":"0","slug":"sum@v1",
        "docs":"[]","images":"[]","date": "1675526107817","abstract":"Software development is a complex process that requires careful planning and execution. The CUB methodology is a new approach that combines Scrum framework and UML design principles to create a more efficient and effective development process by focusing on three main stages of software development; create, update and behave",
        "url": "http://duno.altervista.org/games/sum/"
    },
    {
        "id":"23","status":"1","category":"game","title":"Gamification","vip":"0","slug":"sum@v2",
        "docs":"[]","images":"[]","date": "1675526107817","abstract":"Gamification is an abstraction pattern by which the mind is able to form universal properties of distinct objects. This encourages people to engage with and enjoy all type of system contexts by incorporating game elements and mechanics",
        "url": "http://duno.altervista.org/games/sumv2/"
    },
    {
        "id":"24","status":"1","category":"game","title":"Diagram Script Generation","vip":"0","slug":"color@v1",
        "docs":"[]","images":"[]","date": "1675526107817","abstract":"The article discusses the limitations of visual design-oriented diagramming tools and argues that there is a need for diagramming tools that are specifically catered to software engineers. It then explores the viability of using ChatGPT as a diagramming tool, taking into account the specific requirements of software engineers. Finally, the article proposes the idea of diagram text-based generation using ChatGPT",
        "url": "http://duno.altervista.org/games/colorplus/"
    }
]